export default class Regexps {
    constructor() {}
    /***
     * 手机号码正则表达式
     */
    static mobile = /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/
    /*** 用户名正则
     * 1.可以是中英文和·
     * 2.长度在16个字符以内
     */
    static realName = /^[\u4E00-\u9FA5A-Za-z\s]+(·[\u4E00-\u9FA5A-Za-z]+)*$/
    /*** 登陆账户正则
     *  4到16位（字母，数字，下划线，减号）
     */
    static userName = /^[a-zA-Z0-9_-]{4,16}$/
    /*** 登陆密码正则
     * 1.长度为6-16位不包含中文的密码
     */
    static password = /^[^\u4e00-\u9fa5]{6,16}$/
    /***
     *正整数
     */
    static positiveInteger = /^[1-9]\d*$/
    /**
     * ip地址正则
     */
    static ip = /(2(5[0-5]{1}|[0-4]\d{1})|[0-1]?\d{1,2})(\.(2(5[0-5]{1}|[0-4]\d{1})|[0-1]?\d{1,2})){3}/g
}
